Tekla.Structures.Filtering.BinaryFilterExpressionItem
The BinaryFilterExpressionItem class represents a data item in a Tekla.Structures.Filtering.BinaryFilterExpressionCollection.
This class cannot be inherited.
Tekla.Structures.Filtering.BinaryFilterExpression
Tekla.Structures.Filtering.BinaryFilterExpressionCollection

Tekla.Structures.Filtering.BinaryFilterExpressionItem.#ctor(Tekla.Structures.Filtering.FilterExpression)
Initializes a new instance of the BinaryFilterExpressionItem class.
FilterExpression: The filter expression to collect.
Throws Tekla.Structures.Filtering.InvalidFilterExpressionException: Thrown when an invalid filter expression is specified.
Throws System.ArgumentNullException: Thrown when a null filter expression is specified.

Tekla.Structures.Filtering.BinaryFilterExpressionItem.#ctor(Tekla.Structures.Filtering.FilterExpression,Tekla.Structures.Filtering.BinaryFilterOperatorType)
Initializes a new instance of the BinaryFilterExpressionItem class.
FilterExpression: The Tekla.Structures.Filtering.BinaryFilterExpressionItem.FilterExpression object to collect.
BinaryFilterItemOperatorType: The operator type to be used against the next item.
Throws System.ArgumentNullException: Thrown when a null filter expression is specified.

Tekla.Structures.Filtering.BinaryFilterExpressionItem.FilterExpression
Gets or sets the FilterExpression object.

Tekla.Structures.Filtering.BinaryFilterExpressionItem.BinaryFilterItemOperatorType
Gets or sets the BinaryFilterItemOperatorType.